package com.iwangwei.testsimhash;

import com.iwangwei.testsimhash.dao.ResourceDao;
import com.iwangwei.testsimhash.dao.SolrResourceDao;
import com.iwangwei.testsimhash.utils.*;
import org.junit.jupiter.api.Test;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;
import org.springframework.data.domain.Page;
import org.springframework.data.domain.PageRequest;
import org.springframework.data.domain.Pageable;
import org.springframework.data.domain.Sort;
import org.springframework.util.CollectionUtils;

import java.util.List;

@SpringBootTest
public class CalcSimHash {

    @Autowired
    ResourceDao resourceDao;
    @Autowired
    SolrResourceDao solrResourceDao;

    @Test
    public void calcAnsSave() {
        int minId = 0;

//        while (true) {
//            List<Resource> resources = resourceDao.getSomeResource(minId);
//            if (CollectionUtils.isEmpty(resources)) {
//                break;
//            }

//            resources.forEach(resource -> {
//                ResourceSimHash resourceSimHash = new ResourceSimHash();
//                resourceSimHash.setResourceId(resource.getId());
//                resourceSimHash.setTitle(resource.getTitle());
//
//                List<String> words = TokenUtils.getTokens(resource.getTitle());
//                resourceSimHash.setHash(SimHashUtils.simHash(words));
//
//                resourceDao.insertSimHash(resourceSimHash);
//            });
//        }

        int page = 0;
        while (true) {
            System.out.println("page: "+page);
            Pageable pageable = PageRequest.of(page++, 1000, Sort.by(Sort.Order.asc("id")));
            Page<SolrResourceFile> resourceFilePage = solrResourceDao.findAll(pageable);
            if (resourceFilePage.getSize() > 0) {
                List<SolrResourceFile> solrResourceFiles = resourceFilePage.getContent();
                System.out.println(solrResourceFiles.size());

                solrResourceFiles.forEach(resource -> {
                    ResourceSimHash resourceSimHash = new ResourceSimHash();
                    resourceSimHash.setResourceId(Integer.parseInt(resource.getId()));

                    List<String> words = TokenUtils.getTokens(resource.getContent());
                    resourceSimHash.setHash(SimHashUtils.simHash(words));

                    resourceDao.insertSimHash(resourceSimHash);
                });

            }
        }



    }

    @Test
    public void testMostSimilarTitle() {
        List<ResourceSimHash> simHashes = resourceDao.getAllResourceHash();
        String title = "刘洪江的历史专题整理二:中国国民党史 一、选择题:在每小题列出的四个选项中,只有一项是符合题目要求的。   1.表明中国同盟会的性质是资产阶级政党的是①提出“三民主义”②推举孙中山为总理③制定了同盟会章程④1905年成立于日本东京   A.①②③④ B.①②③ C.①② D.①③   2.资产阶级革命派的“平均地权”方案在本质上  A.是一种平均主义纲领  B.是资本主义的土地纲领 C.没有改变地主土地所有制  D.废除了地主土地所有制 3.辛亥革命最突出的历史功绩是 A.是一次比较完整意义上的资产阶级革命 B.推翻了清朝,结束了两千多年的封建君主专制政体 C.建立了民国,颁布了约法,使民主共和观念深入人心 D.打击了帝国主义列强在中国的殖民统治,为中国民族资本主义的发展创造了条件 4.辛亥革命对戊戍变法的继承和发展主要表现在①资产阶级革命思想的传播②挽救民族危亡,发展资本主义的主张③采取社会改良的办法达到目的④实行资本主义的政治制度 A.①②③④ B.②④ C.①②④ D.①② 5.吴玉章说:“从辛亥革命起,我们为推翻清王朝而迁就袁世凯,后来为了反对北洋军阀而利用西南军阀,再后来为抵制西南军阀而培植陈炯明,最后陈炯明叛变了。这样看来,从前的一套革命老办法非改不可,我们要从头做起。”这表明当时革命党人意识到要进行哪方面的改革 A.革命纲领 B.革命力量 C.革命方式 D.革命对象 6.国共两党能进行第一次国共合作从根本上说是因为 A.第三国际的推动  B.国民党是比较真正的民主派 C.第一次工人运动失败的历史教训  D.“打倒列强,除军阀”是全国人民的共同愿望 7.国民革命时期作为国民革命中心的城市有 A.汉口、九江 B.武汉、南京 C.北京、上海 D.广州、武汉 8.下列关于国民大革命历史意义的表述不正确的是 A.是中国近代前所未有的人民大革命  B.沉重打击了帝国主义的侵华势力 C.基本上推毁了封建军阀统治的基础  D.使中国共产党开始掌握一部分军队 9.1927年“四·一二”反革命政变后,在我国并存的政权中没有 A.广东革命政府 B.武汉国民政府 C.南京国民政府 D.北洋军阀政府 10.新旧三民主义的不同点是①反对帝国主义的侵略②民权为一般平民所共有③节制资本④反对民族压迫 A.①②③ B.①②③④ C.②③④ D.①③④ 11.下列关于国民政府统治前期经济发展的表述不正确的是 A.1936年工业总产值比1927年增加80% B.轻工业发展最快,重工业、农业也有所发展 C.在经济发展中,四大家族迅速聚敛巨额财富 D.在帝国主义和官僚资本主义的压迫下,民族工业发展缓慢。 12.1931~1936年,中国抗日民主运动的特点是①抗日与反蒋相结合②参加者既有人民群众也有国民党将领③都有中国共产党领导④主要抗日力量未能有效地联合起来 A.①②④ B.①②③④ C.①③ D.③④ 13.1933年11月“中华共和国人民革命政府”与红军签订《抗日停战协议》,这表明 A.红军与抗日反蒋力量结成了抗日民族统一战线 B.中华民族已处在亡国灭种的危急关头 C.中共党内的“左”倾错误已经不占统治地位 D.蒋介石“攘外必先安内”政策不得人心 14.西安事变和平解决之所以成为扭转时局的关键,主要是因为 A.反映了全国各阶层实现团结抗日的愿望  B.迫使蒋介石放弃了反共政策 C.使亲日派的阴谋未能实现  D.揭开了全民族抗战的序幕 15.从北伐战争到抗日战争,国民政府所在地迁移的正确顺序是 A.广州→武汉→南京→重庆  B.广州→南京→武汉→重庆 C.广州→南京→重庆→武汉  D.广州→武汉→重庆→南京 16.在抗日战争相持阶段,蒋介石政治态度表现出两面性的最主要原因是 A.中国民族资产阶级的两面性  B.日本改变侵华方针的影响 C.民族矛盾和阶级矛盾的相互作用  D.世界反法西斯战场战局的变化 17.以下是抗战初期国民政府的作战方针:“国军一部集中华北持久抵抗,特别注意确保山西之天然壁垒,国军主力集中华东,攻击上海之敌,力保淞沪要地,巩固首都;另以最少兵力防守华南各港口。”对这一作战方针的评价不正确的是 A.体现了国民政府武装自卫的决心 B.体现了片面抗战的路线 C.体现了战略防御的特点 D.体现了国民政府消极抵抗的态度 18.皖南事变的发生及解决,表明当时蒋介石的政治态度是 A.在对待共产党的问题上存在着两面性 B.坚持一贯的反共政策 C.在对待日本问题上存在着两面性 D.放弃抗日转为反共 19.抗日战争时期,国民党统治的特征是 A.一党专政,特务统治,保甲制度三者结合、渗透 B.一党专政,特务统治,奴化教育三者结合、渗透 C.统制经济,一党专政,奴化教育三者结合、渗透 D.一党专政,特务统治,统制经济三者结合、渗透 20.下列对1938年10月以前国民政府抗战的评价正确的是 A.消极避战导致大片国土丢失  B.积极反共导致对日作战不力 C.阻滞了日本军队的侵略进程  D.努力奋战保住了西部大片国土 21.第二次国共合作得以长期维持的主要经验是 A.以民族大义为重,对国民党的反共摩擦予以理解 B.党外合作,保持中共在统一战线中的绝对领导地位 C.在统一战线中以斗争求团结 D.维护国民党在统一战线中的领导地位 22.重庆谈判和《双十协定》的签订 A.打击了蒋介石的内战政策  B.使蒋介石政治上陷于被动 C.配合了解放战争的顺利进行  D.使解放区获得了合法地位 23.重庆政协决议和“双十协定”最突出的〖ZZ3〗不同点是 A.避免内战,和平建国问题  B.召开国民大会,制定宪法问题 C.实现民主政治问题  D.整编全国军队和改组国民政府问题 24.抗战胜利后,美国为建立一个可靠的亲美政权而采取的首要措施是 A.帮助蒋介石政府民主化  B.促成国共的政治合作 C.打击原亲日派势力  D.阻止共产党控制中国 25.解放战争时期,形成了反对国民党统治的第二条战线,能够形成的主要原因是 A.人民掀起反对国民党统治的高潮  B.国民党极力强化一党独裁统治 C.中国共产党广泛的政治宣传  D.各民主党派纷纷同国民党决裂 26.1947年1月,中国民主同盟三中全会宣布拒绝解散民盟,“至于独立的中间路线,从目前中国的现实环境看,更难行通”,“只有消灭反和平的独裁政权,才能建立一个真民主、真和平的新中国”。这表明①民盟坚决主张维护和平,反对内战②民盟放弃了对国民党政权的幻想③独裁政权是中国人民的大敌④民盟赞同中共的新民主主义革命的目标 A.①②③④ B.②③④ C.②④ D.①③ 27.有人说:“民盟被迫解散,是民盟史上的一大挫折,但也是民盟转变的起点。”这里的转变是指 A.由执行中间路线到与中共联合反蒋  B.由合法斗争转入暴力革命 C.由公开斗争转入秘密斗争  D.由与国民党联合到与之分裂 28.1948年,美国驻华大使司徒雷登说:“国民党内弥漫腐化和反动势力,已是尽人皆知。我现在主要担心的是,通过对他们(指民盟等民主力量)的鲁莽迫害,政府将进一步使自己丧失名誉。”当时司徒雷登对华的实际立场是 A.仍然不放弃对国民党政权的支持  B.开始倾向于建立民主联合政府 C.建议美国政府放弃对国民政府的支持  D.希望有其他党派来取代国民党 29.中国近代史上出现过几次资产阶级民主政治的机遇,先后发生于①洋务运动时②戊戌变法时③辛亥革命时④大革命后⑤抗日战争胜利时⑥解放战争胜利时 A.①②③ B.④⑤⑥ C.②③⑤ D.②③④⑤ 30.导致民国时期我国科学技术发展落后的原因有①我国自然科学基础薄弱,落后于西方②内战频繁,外敌入侵③当时人们重视实业,轻视科技④国民政府重视不够 A.①②③④ B.②③④ C.①②④ D.①②③ 二、材料解析题 31.请仔细阅读下列材料,运用你所掌握的历史知识和这些材料提供的信息回答问题:  材料一 “人能尽其才,地能尽其利,物能尽其用,货能畅其流。此四事者,富强之大经,治国之大本也。……试观日本一国,与西人通商后于我,仿效西方亦后于我,其维新之政为日几何,而今日成效已大有可观……。” ——孙中山:《上李鸿章书》,1894年6月  材料二 “革命为惟一法门。”“我们必须倾覆满洲政府,建设民国。革命成功之日,……废除专制,实行共和。”   ——孙中山:《在檀香山正埠荷梯厘街戏院的演说》,1903年12月13日  材料三 “这十三年来,政治上、社会上种种黑暗腐败比前清更甚,人民困苦,日甚一日,……俄国虽迟我六年革命,而已成功;我虽早六年革命,而仍失败。”   ——孙中山:《中国之现状及国民党改组问题》,1924年1月  材料四 “我已嘱咐国民党进行民族革命运动之工作,俾中国可免帝国主义加诸中国的半殖民地状况之羁缚。为达到此目的起见,我已命国民党长此继续与你们提携。” ——孙中山:《致苏俄遗书》,1925年3月 根据以上材料,评述孙中山先生一直追求真理的历程。 (要求:表述成文,逻辑清楚,字数不超过250字) 32.阅读下列材料:  材料一 1928年9月张学良对东北大学生的训词:“要将自己看小些,就是说自己不要看的太重,而有害于国家。” ——《张学良文集》第Ⅰ集  材料二 “九·一八”事变后张学良说:“我爱中国,我更爱东北,因为我的祖宗庐墓均在东北,如由余手失去东北,余心永远不安。但余实在不愿以他人的生命财产,作余个人的牺牲,且不愿以多年相随、屡共患难的部属的生命,博余一人民族英雄的头衔。” ——《文史资料选辑》第6辑  材料三 1933年张学良对人说:“只要有人能把日本帝国主义打出去,不论他是哪一个阶层的人,我都愿意把我自己所有的力量给他,并且我愿意无条件地听命于他。” ——《黎天才自传》  材料四 1934年1月张学良说:“青年人‘何以无出路,还不是由于你的国家太弱了吗?’整个国家的苦闷与无出路,是高于你个人问题的几千万倍……只有解决国家问题,才有个人的出路。” ——《张学良文集》第Ⅰ集 请回答: (1)据材料一、三、四,概括张学良的思想倾向。 (2)材料二反映出张学良的思想有何变化?为什么会发生这种变化? (3)对比材料二、三,说明张学良对日态度有什么变化?为什么? (4)据上述材料,归纳张学良思想主张的要点,概括张学良不同思想主张出现的根源。 三、问答题 33.毛泽东在《论反对日本帝国主义的策略》中指出:“我们党内持这样一种论点的人是不对的,他们说,整个地主资产阶级的营垒是统一的、固定的,任何情况下也不能使它起变化。”结合20世纪30年代初期和中期的重大史实,说明这一观点的正确性,并分析地主资产阶级营垒分化的原因。 34.1946年,重庆政协会议通过了和平建国纲领。对此有人作了如下评论:“共产党的让步多,蒋介石的苦恼大,民盟的前途看好。”试结合有关史实分析共产党“让步多”、国民党“苦恼大”的原因。并结合此后中国政治局势的发展状况,评析“民盟前途看好”的说法是否正确。 【参考答案】 一、选择题  1.B 2.B 3.B 4.B 5.C 6.D 7.D 8.C 9.A10.A 11.D 12.A 13.D 14.D 15.A 16.C 17.D 18.A 19.A 20.C 21.C 22.B 23.D 24.D 25.B 26.A 27.A 28.A 29.D 30.C 二、材料解析题 31.19世纪末,民族危机不断,孙中山上书李鸿章,希望清政府变法维新,使中国走上富强之路。上书的失败,促使孙中山先生放弃了对清政府的幻想,走上了民主革命的道路,主张用革命推翻清政府,走民主共和的道路。孙中山先生为此进行了坚韧不拔的斗争,但却屡遭失败。在共产国际帮助和中国共产党的支持下,孙中山先生接受了反帝国主义的斗争主张,提出了新三民主义和“联俄、联共、扶助农工”的三大政策,实现了他一生中的伟大转变。孙中山先生是中国民主革命的先行者,他顺应时代潮流,不断追求真理和为真理而斗争的精神永远值得我们学习。 32. (1)爱国主义思想。  (2)将东北的局部利益放在国家利益之上,即狭隘的爱国主义思想。原因:蒋介石不抵抗政策的影响;保存东北军实力;对日军有恐惧心理。  (3)由对日不抵抗到决心抵抗。原因:当时中日矛盾激化,日军占领了东北,李顿调查团纵容日本侵略东北,使张学良依靠国联的幻想破灭。  (4)东北易帜是为了国家统一和富强,要将国家利益放在个人利益之上;誓死不能放弃东北;为了抗日可以牺牲一切;天下兴亡,匹夫有责。社会主要矛盾的变化。 三、问答题 33.20世纪30年代,随着日本不断扩大对华侵略,在中华民族危机日益深重的形势下,地主资产阶级营垒出现了分化:  (1)1932年,马占山组织“黑龙江省民众抗日救国义勇军”,在江桥等地抗日。  (2)1932年,驻守淞沪的国民党十九路军在蔡廷锴、蒋光鼐率领下奋起抗击日军。  (3)1933年,冯玉祥与共产党员吉鸿昌合作,组织“察哈尔民众抗日同盟军”,多次重击日军。  (4)1933年,蔡廷锴联合国民党内爱国力量,举起抗日反蒋旗帜。在福建省成立“中华共和国人民革命政府”,与蒋分庭抗战。  (5)1936年,张学良、杨虎城发动“西安事变”逼蒋抗日。这些活生生的史实充分证明毛泽东的论断的正确性。  原因:(1)“九·一八”事变后,蒋介石对外“抵抗”,对内镇压抗日爱国力量,引起了包括民族资产阶级在内的国内各阶层人民和海外侨胞的普遍不满,也遭到国民党爱国将领公开反对。  (2)在半殖民地的中国,地主资产阶级营垒中由于其利害关系及所依附的国际力量不同,也不是完全统一的。随着日本帝国主义逐步加紧侵略,中日民族矛盾逐步上升为中国社会的主要矛盾,日本的侵略也损害了其他的帝国主义国家利益时,地主资产阶级营垒也会发生分化。 34.共产党“让步多”的原因:为了团结民主党派和无党派人士,同国民党的一党专政和蒋介石的个人独裁进行斗争;为了争取主动,避免内战,实现民主政治,和平建国。  蒋介石“苦恼大”的原因:政协会议上,共产党与民盟合作,同国民党的内战独裁政策进行了有效的斗争,通过的政协决议,冲破了蒋介石的独裁统治,打击了他的内战政策,有利于国内和平、民主,在多方面反映了人民的愿望。因此蒋介石的苦恼大。  这一观点不正确。重庆政协决议较多地吸收了民盟等中间派的意见,政协会议在很大程度上反映了中间派在中国实行欧美资产阶级民主政治的要求,在一定程度上反映了这次会议的斗争成果。但以后的历史证明,蒋介石不允许民主改革,很快撕毁了政协决议,发动了全面内战,之后又宣布民盟为非法团体,强令民盟解散。这种说法,反映了对局势的盲目乐观,没有认清蒋介石的独裁专政的本质,因而是不全面的。";
        String titleHash = SimHashUtils.simHash(TokenUtils.getTokens(title));

        int minDistance = 100;

        for (ResourceSimHash simHash : simHashes) {
            int distance = SimHashUtils.getDistance(titleHash, simHash.getHash());
            if (distance < minDistance) {
                minDistance = distance;
                System.out.println(String.format("%s %s", distance, simHash.getResourceId()));
            }
        }
    }
}
